Revit 2024 API
DefaultDivideSettings.GetSurfaceNumber Method
 Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public int GetSurfaceNumber(
	UVGridlineType gridlines
)
Visual Basic
Public Function GetSurfaceNumber ( _
	gridlines As UVGridlineType _
) As Integer
Visual C++
public:
int GetSurfaceNumber(
	UVGridlineType gridlines
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
Return Value
 The default number for a fixed number layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace